# IsDuplicateShapePresent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeMultiplanarDefinition..::..IsDuplicateShapePresent Property
RebarShapeMultiplanarDefinition Class See Also
---
Whether the shape definition includes an offset copy of the 2D shape.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsDuplicateShapePresent { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsDuplicateShapePresent As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsDuplicateShapePresent {
	bool get ();
}
```

# See Also
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace